# GetTargetElementIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ReferenceIntersector..::..GetTargetElementIds Method
ReferenceIntersector Class See Also
---
Gets the set of ElementIds to test from in intersection testing.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ICollection<ElementId> GetTargetElementIds()
```

Visual Basic
---
```text
Public Function GetTargetElementIds As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetTargetElementIds()
```

# ### Return Value
The target ElementIds.
# See Also
ReferenceIntersector Class
Autodesk.Revit.DB Namespace